output/load-test/api-read-50vus-fixed.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/api-read.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * api_read: 50 looping VUs for 30s (gracefulStop: 30s)

time="2026-06-17T21:31:29+08:00" level=info msg="setup: 已集中登录，token 长度 519，将共享给 50 个 VU" source=console

running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
api_read   [   3% ] 50 VUs  00.9s/30s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
api_read   [   6% ] 50 VUs  01.9s/30s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
api_read   [  10% ] 50 VUs  02.9s/30s

running (0m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
api_read   [  13% ] 50 VUs  03.9s/30s

running (0m05.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
api_read   [  16% ] 50 VUs  04.9s/30s

running (0m06.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
api_read   [  20% ] 50 VUs  05.9s/30s

running (0m07.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
api_read   [  23% ] 50 VUs  06.9s/30s

running (0m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
api_read   [  26% ] 50 VUs  07.9s/30s

running (0m09.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
api_read   [  30% ] 50 VUs  08.9s/30s

running (0m10.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
api_read   [  33% ] 50 VUs  09.9s/30s

running (0m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
api_read   [  36% ] 50 VUs  10.9s/30s

running (0m12.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
api_read   [  40% ] 50 VUs  11.9s/30s

running (0m13.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
api_read   [  43% ] 50 VUs  12.9s/30s

running (0m14.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
api_read   [  46% ] 50 VUs  13.9s/30s

running (0m15.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
api_read   [  50% ] 50 VUs  14.9s/30s

running (0m16.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
api_read   [  53% ] 50 VUs  15.9s/30s

running (0m17.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
api_read   [  56% ] 50 VUs  16.9s/30s

running (0m18.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
api_read   [  60% ] 50 VUs  17.9s/30s

running (0m19.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
api_read   [  63% ] 50 VUs  18.9s/30s

running (0m20.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
api_read   [  66% ] 50 VUs  19.9s/30s

running (0m21.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
api_read   [  70% ] 50 VUs  20.9s/30s

running (0m22.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
api_read   [  73% ] 50 VUs  21.9s/30s

running (0m23.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
api_read   [  76% ] 50 VUs  22.9s/30s

running (0m24.0s), 50/50 VUs, 1145 complete and 0 interrupted iterations
api_read   [  80% ] 50 VUs  23.9s/30s

running (0m25.0s), 50/50 VUs, 1188 complete and 0 interrupted iterations
api_read   [  83% ] 50 VUs  24.9s/30s

running (0m26.0s), 50/50 VUs, 1238 complete and 0 interrupted iterations
api_read   [  86% ] 50 VUs  25.9s/30s

running (0m27.0s), 50/50 VUs, 1288 complete and 0 interrupted iterations
api_read   [  90% ] 50 VUs  26.9s/30s

running (0m28.0s), 50/50 VUs, 1338 complete and 0 interrupted iterations
api_read   [  93% ] 50 VUs  27.9s/30s

running (0m29.0s), 50/50 VUs, 1378 complete and 0 interrupted iterations
api_read   [  96% ] 50 VUs  28.9s/30s

running (0m30.0s), 50/50 VUs, 1419 complete and 0 interrupted iterations
api_read   [ 100% ] 50 VUs  29.9s/30s

running (0m31.0s), 41/50 VUs, 1459 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 50 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=12.4ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 15000   481.682235/s
    checks_succeeded...: 100.00% 15000 out of 15000
    checks_failed......: 0.00%   0 out of 15000

    ✓ 设备列表 成功
    ✓ 设备列表 P95<500ms
    ✓ 告警列表 成功
    ✓ 告警列表 P95<500ms
    ✓ 工单列表 成功
    ✓ 工单列表 P95<500ms
    ✓ 仪表盘统计 成功
    ✓ 仪表盘统计 P95<500ms
    ✓ 通知列表 成功
    ✓ 通知列表 P95<500ms

    HTTP
    http_req_duration..............: avg=5.81ms min=961µs med=3.52ms max=137.64ms p(90)=8.73ms p(95)=12.4ms
      { expected_response:true }...: avg=5.81ms min=961µs med=3.52ms max=137.64ms p(90)=8.73ms p(95)=12.4ms
    http_req_failed................: 0.00%  0 out of 7501
    http_reqs......................: 7501   240.87323/s

    EXECUTION
    iteration_duration.............: avg=1.03s  min=1.01s med=1.02s  max=1.12s    p(90)=1.05s  p(95)=1.09s 
    iterations.....................: 1500   48.168223/s
    vus............................: 41     min=41        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 61 MB  1.9 MB/s
    data_sent......................: 5.1 MB 163 kB/s



running (0m31.1s), 00/50 VUs, 1500 complete and 0 interrupted iterations
api_read ✓ [ 100% ] 50 VUs  30s