output/load-test/api-read-50vus.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: api-read.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * api_read: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
api_read   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
api_read   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
api_read   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
api_read   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
api_read   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 36 complete and 0 interrupted iterations
api_read   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 82 complete and 0 interrupted iterations
api_read   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 128 complete and 0 interrupted iterations
api_read   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 178 complete and 0 interrupted iterations
api_read   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 228 complete and 0 interrupted iterations
api_read   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 278 complete and 0 interrupted iterations
api_read   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 328 complete and 0 interrupted iterations
api_read   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 347 complete and 0 interrupted iterations
api_read   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 397 complete and 0 interrupted iterations
api_read   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 447 complete and 0 interrupted iterations
api_read   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 497 complete and 0 interrupted iterations
api_read   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 547 complete and 0 interrupted iterations
api_read   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 597 complete and 0 interrupted iterations
api_read   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 647 complete and 0 interrupted iterations
api_read   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 697 complete and 0 interrupted iterations
api_read   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 747 complete and 0 interrupted iterations
api_read   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 797 complete and 0 interrupted iterations
api_read   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 847 complete and 0 interrupted iterations
api_read   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 897 complete and 0 interrupted iterations
api_read   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 947 complete and 0 interrupted iterations
api_read   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 993 complete and 0 interrupted iterations
api_read   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 1008 complete and 0 interrupted iterations
api_read   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 1011 complete and 0 interrupted iterations
api_read   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 1061 complete and 0 interrupted iterations
api_read   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 1111 complete and 0 interrupted iterations
api_read   [ 100% ] 50 VUs  30.0s/30s

running (0m31.0s), 01/50 VUs, 1160 complete and 0 interrupted iterations
api_read ↓ [ 100% ] 50 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=206.72ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11610  374.573741/s
    checks_succeeded...: 99.28% 11527 out of 11610
    checks_failed......: 0.71%  83 out of 11610

    ✓ 设备列表 成功
    ✗ 设备列表 P95<500ms
      ↳  99% — ✓ 1153 / ✗ 8
    ✓ 告警列表 成功
    ✗ 告警列表 P95<500ms
      ↳  99% — ✓ 1160 / ✗ 1
    ✓ 工单列表 成功
    ✗ 工单列表 P95<500ms
      ↳  99% — ✓ 1155 / ✗ 6
    ✓ 仪表盘统计 成功
    ✗ 仪表盘统计 P95<500ms
      ↳  94% — ✓ 1093 / ✗ 68
    ✓ 通知列表 成功
    ✓ 通知列表 P95<500ms

    HTTP
    http_req_duration..............: avg=61.47ms min=897µs med=4.18ms max=4.64s p(90)=20.71ms p(95)=206.72ms
      { expected_response:true }...: avg=61.47ms min=897µs med=4.18ms max=4.64s p(90)=20.71ms p(95)=206.72ms
    http_req_failed................: 0.00%  0 out of 5855
    http_reqs......................: 5855   188.900022/s

    EXECUTION
    iteration_duration.............: avg=1.31s   min=1s    med=1.02s  max=8.71s p(90)=1.35s   p(95)=2.9s    
    iterations.....................: 1161   37.457374/s
    vus............................: 1      min=1         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 44 MB  1.4 MB/s
    data_sent......................: 4.1 MB 132 kB/s



running (0m31.0s), 00/50 VUs, 1161 complete and 0 interrupted iterations
api_read ✓ [ 100% ] 50 VUs  30s